import React , {useState} from "react";


export const City = props => {



    let stateName = [
       "تهران",
       "گیلان",
       "آذربایجان شرقی",
       "خوزستان",
       "فارس",
       "اصفهان",
       "خراسان رضوی",
       "قزوین",
       "سمنان",
       "قم",
       "مرکزی",
       "زنجان",
       "مازندران",
       "گلستان",
       "اردبیل",
       "آذربایجان غربی",
       "همدان",
       "کردستان",
       "کرمانشاه",
       "لرستان",
       "بوشهر",
       "کرمان",
       "هرمزگان",
       "چهارمحال و بختیاری",
       "یزد",
       "سیستان و بلوچستان",
       "ایلام",
       "کهگلویه و بویراحمد",
       "خراسان شمالی",
       "خراسان جنوبی",
       "البرز",
    ]


    const [citySel , setCitySel] = useState([])

    const handleProvince = state => {
        console.log(stateName[parseInt(state)-1] , "ssss" , state)
        props.handleStateName(stateName[parseInt(state)-1]);
        let options = [];
        if (state == 0) {
            options[0] = ['لطفا استان را انتخاب نمایید', '0'];
        }
        if (state == 1) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['احمدآبادمستوفي', '33131'];
            options[2] = ['ادران', '31541'];
            options[3] = ['اسلام آباد', '18641'];
            options[4] = ['اسلام شهر', '331'];
            options[5] = ['اكبرآباد', '37671'];
            options[6] = ['اميريه', '39861'];
            options[7] = ['انديشه', '31686'];
            options[8] = ['اوشان', '33431'];
            options[9] = ['آبسرد', '39761'];
            options[10] = ['آبعلي', '39741'];
            options[11] = ['باغستان', '33541'];
            options[12] = ['باقر شهر', '18131'];
            options[13] = ['برغان', '33631'];
            options[14] = ['بومهن', '16551'];
            options[15] = ['پارچين', '33971'];
            options[16] = ['پاكدشت', '3391'];
            options[17] = ['پرديس', '16581'];
            options[18] = ['پرند', '37611'];
            options[19] = ['پس قلعه', '19731'];
            options[20] = ['پيشوا', '3381'];
            options[21] = ['تجزيه مبادلات لشكر  ', '1012'];
            options[22] = ['تهران', '1'];
            options[23] = ['جاجرود', '16531'];
            options[24] = ['چرمسازي سالاريه', '18361'];
            options[25] = ['چهاردانگه', '33191'];
            options[26] = ['حسن آباد', '18331'];
            options[27] = ['حومه گلندوك', '33411'];
            options[28] = ['خاتون آباد', '33991'];
            options[29] = ['خاوه', '33841'];
            options[30] = ['خرمدشت', '16571'];
            options[31] = ['دركه', '19841'];
            options[32] = ['دماوند', '3971'];
            options[33] = ['رباط كريم', '3761'];
            options[34] = ['رزگان', '37561'];
            options[35] = ['رودهن', '39731'];
            options[36] = ['ري', '1813'];
            options[37] = ['سعيدآباد', '33361'];
            options[38] = ['سلطان آباد', '37631'];
            options[39] = ['سوهانك', '19561'];
            options[40] = ['شاهدشهر', '33561'];
            options[41] = ['شريف آباد', '33941'];
            options[42] = ['شمس آباد', '18341'];
            options[43] = ['شهر قدس', '3751'];
            options[44] = ['شهرآباد', '33551'];
            options[45] = ['شهرجديدپرديس', '16561'];
            options[46] = ['شهرقدس(مويز)', '37511'];
            options[47] = ['شهريار', '3351'];
            options[48] = ['شهرياربردآباد', '33511'];
            options[49] = ['صالح آباد', '33171'];
            options[50] = ['صفادشت', '31641'];
            options[51] = ['فرودگاه امام خميني', '18381'];
            options[52] = ['فرون آباد', '18471'];
            options[53] = ['فشم', '33451'];
            options[54] = ['فيروزكوه', '3981'];
            options[55] = ['قرچك', '18686'];
            options[56] = ['قيام دشت', '18661'];
            options[57] = ['كهريزك', '18161'];
            options[58] = ['كيلان', '39751'];
            options[59] = ['گلدسته', '33151'];
            options[60] = ['گلستان (بهارستان)', '37571'];
            options[61] = ['گيلاوند', '39711'];
            options[62] = ['لواسان', '3341'];
            options[63] = ['لوسان بزرگ', '33461'];
            options[64] = ['مارليك', '37541'];
            options[65] = ['مروزبهرام', '33141'];
            options[66] = ['ملارد', '31691'];
            options[67] = ['منطقه 11 پستي تهران', '1011'];
            options[68] = ['منطقه 13 پستي تهران', '1013'];
            options[69] = ['منطقه 14 پستي تهران', '1014'];
            options[70] = ['منطقه 15 پستي تهران', '1015'];
            options[71] = ['منطقه 16 پستي تهران', '1016'];
            options[72] = ['منطقه 17 پستي تهران  ', '1017'];
            options[73] = ['منطقه 18 پستي تهران  ', '1018'];
            options[74] = ['منطقه 19 پستي تهران  ', '1019'];
            options[75] = ['نسيم شهر (بهارستان)', '37651'];
            options[76] = ['نصيرآباد', '37551'];
            options[77] = ['واوان', '33176'];
            options[78] = ['وحيديه', '33581'];
            options[79] = ['ورامين', '3371'];
            options[80] = ['وهن آباد', '18391'];
        }
        if (state == 2) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['احمد سرگوراب', '43591'];
            options[2] = ['اسالم', '43891'];
            options[3] = ['اسكلك', '44681'];
            options[4] = ['اسلام آباد', '43371'];
            options[5] = ['اطاقور', '44791'];
            options[6] = ['املش', '44951'];
            options[7] = ['آبكنار', '4331'];
            options[8] = ['آستارا', '4391'];
            options[9] = ['آستانه اشرفيه', '4441'];
            options[10] = ['بازاراسالم', '43731'];
            options[11] = ['بازارجمعه شاندرمن', '43811'];
            options[12] = ['برهسر', '44561'];
            options[13] = ['بلترك', '44941'];
            options[14] = ['بلسبنه', '43471'];
            options[15] = ['بندرانزلي', '431'];
            options[16] = ['پاشاكي', '44331'];
            options[17] = ['پرهسر', '43861'];
            options[18] = ['پلاسي', '43791'];
            options[19] = ['پونل', '44992'];
            options[20] = ['پيربست لولمان', '43441'];
            options[21] = ['توتكابن', '44651'];
            options[22] = ['جوكندان', '43751'];
            options[23] = ['جيرنده', '44551'];
            options[24] = ['چابكسر', '44871'];
            options[25] = ['چاپارخانه', '43481'];
            options[26] = ['چوبر', '43561'];
            options[27] = ['خاچكين', '43451'];
            options[28] = ['خشك بيجار', '43391'];
            options[29] = ['خطبه سرا', '43771'];
            options[30] = ['خمام', '4341'];
            options[31] = ['ديلمان', '44391'];
            options[32] = ['رانكوه', '44861'];
            options[33] = ['رحيم آباد', '44931'];
            options[34] = ['رستم آباد', '44641'];
            options[35] = ['رشت', '41'];
            options[36] = ['رضوان شهر', '43841'];
            options[37] = ['رودبار', '4461'];
            options[38] = ['رودسر', '4481'];
            options[39] = ['سراوان', '43381'];
            options[40] = ['سنگر', '43361'];
            options[41] = ['سياهكل', '4431'];
            options[42] = ['شاندرمن', '43851'];
            options[43] = ['شفت', '43541'];
            options[44] = ['صومعه سرا', '4361'];
            options[45] = ['طاهر گوداب', '43651'];
            options[46] = ['طوللات', '44851'];
            options[47] = ['فومن', '4351'];
            options[48] = ['قاسم آبادسفلي', '44831'];
            options[49] = ['كپورچال', '43331'];
            options[50] = ['كلاچاي', '4491'];
            options[51] = ['كوچصفهان', '43461'];
            options[52] = ['كومله', '44761'];
            options[53] = ['كياشهر', '44471'];
            options[54] = ['گشت', '43581'];
            options[55] = ['لاهيجان', '441'];
            options[56] = ['لشت نشا', '43431'];
            options[57] = ['لنگرود', '4471'];
            options[58] = ['لوشان', '44531'];
            options[59] = ['لولمان', '43531'];
            options[60] = ['لوندويل', '43961'];
            options[61] = ['ليسار', '43761'];
            options[62] = ['ماسال', '4381'];
            options[63] = ['ماسوله', '43571'];
            options[64] = ['منجيل', '4451'];
            options[65] = ['هشتپر ـ طوالش', '4371'];
            options[66] = ['واجارگاه', '44891'];
        }
        if (state == 3) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابشاحمد', '54671'];
            options[2] = ['اذغان', '54561'];
            options[3] = ['اسب فروشان', '54731'];
            options[4] = ['اسكو', '5351'];
            options[5] = ['اغچه ريش', '5586'];
            options[6] = ['اقمنار', '55661'];
            options[7] = ['القو', '55541'];
            options[8] = ['اهر', '5451'];
            options[9] = ['ايلخچي', '53581'];
            options[10] = ['آذرشهر', '5371'];
            options[11] = ['باسمنج', '53661'];
            options[12] = ['بخشايش ـ كلوانق', '53951'];
            options[13] = ['بستان آباد', '5491'];
            options[14] = ['بناب', '5551'];
            options[15] = ['بناب جديد ـ مرند', '54351'];
            options[16] = ['تبريز', '51'];
            options[17] = ['ترك', '53331'];
            options[18] = ['تسوج', '53881'];
            options[19] = ['جلفا', '5441'];
            options[20] = ['خامنه', '53841'];
            options[21] = ['خداآفرين', '54683'];
            options[22] = ['خسروشهر', '53551'];
            options[23] = ['خضرلو', '55441'];
            options[24] = ['خلجان', '53641'];
            options[25] = ['سبلان', '5321'];
            options[26] = ['سراب', '5471'];
            options[27] = ['سردرود', '5361'];
            options[28] = ['سيس', '53851'];
            options[29] = ['شادبادمشايخ', '53671'];
            options[30] = ['شبستر', '5381'];
            options[31] = ['شربيان', '54751'];
            options[32] = ['شرفخانه', '53891'];
            options[33] = ['شهر جديد سهند', '5331'];
            options[34] = ['صوفيان', '53861'];
            options[35] = ['عجب شير', '5541'];
            options[36] = ['قره اغاج ـ چاراويماق', '5581'];
            options[37] = ['قره بابا', '54941'];
            options[38] = ['كردكندي', '54971'];
            options[39] = ['كليبر', '5461'];
            options[40] = ['كندرود', '53681'];
            options[41] = ['كندوان', '54685'];
            options[42] = ['گوگان', '53761'];
            options[43] = ['مراغه', '551'];
            options[44] = ['مرند', '541'];
            options[45] = ['ملكان', '5561'];
            options[46] = ['ممقان', '53751'];
            options[47] = ['ميانه', '531'];
            options[48] = ['هاديشهر', '5431'];
            options[49] = ['هريس', '5391'];
            options[50] = ['هشترود', '5571'];
            options[51] = ['هوراند', '54491'];
            options[52] = ['ورزقان', '54581'];
        }
        if (state == 4) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اروندكنار', '6331'];
            options[2] = ['اميديه', '63731'];
            options[3] = ['انديمشك', '6481'];
            options[4] = ['اهواز', '61'];
            options[5] = ['ايذه', '6391'];
            options[6] = ['آبادان', '631'];
            options[7] = ['آغاجاري', '6371'];
            options[8] = ['باغ ملك', '63951'];
            options[9] = ['بندرامام خميني', '63561'];
            options[10] = ['بهبهان', '6361'];
            options[11] = ['جايزان', '63881'];
            options[12] = ['جنت مكان', '64541'];
            options[13] = ['چمران ـ شهرك طالقاني ', '63541'];
            options[14] = ['حميديه', '63441'];
            options[15] = ['خرمشهر', '641'];
            options[16] = ['دزآب', '64651'];
            options[17] = ['دزفول', '6461'];
            options[18] = ['دهدز', '63991'];
            options[19] = ['رامشير', '63871'];
            options[20] = ['رامهرمز', '6381'];
            options[21] = ['سربندر', '63551'];
            options[22] = ['سردشت', '63681'];
            options[23] = ['سماله', '64561'];
            options[24] = ['سوسنگرد ـ دشت آزادگان', '6441'];
            options[25] = ['شادگان', '6431'];
            options[26] = ['شرافت', '64511'];
            options[27] = ['شوش', '6471'];
            options[28] = ['شوشتر', '6451'];
            options[29] = ['شيبان', '61481'];
            options[30] = ['صالح مشطت', '64791'];
            options[31] = ['كردستان بزرگ', '63661'];
            options[32] = ['گتوند', '64551'];
            options[33] = ['لالي', '64941'];
            options[34] = ['ماهشهر', '6351'];
            options[35] = ['مسجد سليمان', '6491'];
            options[36] = ['ملاثاني', '6341'];
            options[37] = ['ميانكوه', '63751'];
            options[38] = ['هفتگل', '64961'];
            options[39] = ['هنديجان', '63591'];
            options[40] = ['هويزه', '64451'];
            options[41] = ['ويس', '61491'];
        }
        if (state == 5) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = [' بيضا', '73631'];
            options[2] = ['اردكان ـ سپيدان', '7361'];
            options[3] = ['ارسنجان', '73761'];
            options[4] = ['استهبان', '7451'];
            options[5] = ['اشكنان ـ اهل', '74391'];
            options[6] = ['اقليد', '7381'];
            options[7] = ['اكبرآبادكوار', '71651'];
            options[8] = ['اوز', '74331'];
            options[9] = ['ايزدخواست', '73991'];
            options[10] = ['آباده', '7391'];
            options[11] = ['آباده طشك', '74931'];
            options[12] = ['بالاده', '73391'];
            options[13] = ['بانش', '73681'];
            options[14] = ['بنارويه', '74361'];
            options[15] = ['بهمن', '73911'];
            options[16] = ['بوانات', '73941'];
            options[17] = ['بوانات(سوريان)', '73971'];
            options[18] = ['بيرم', '74381'];
            options[19] = ['جنت شهر(دهخير)', '74891'];
            options[20] = ['جهرم', '741'];
            options[21] = ['جويم', '74351'];
            options[22] = ['حاجي آباد ـ زرين دشت', '74861'];
            options[23] = ['حسن آباد', '73841'];
            options[24] = ['خرامه', '73441'];
            options[25] = ['خرمی', '74998'];
            options[26] = ['خشت', '73341'];
            options[27] = ['خنج', '74431'];
            options[28] = ['خيرآبادتوللي', '71451'];
            options[29] = ['داراب', '7481'];
            options[30] = ['داريان', '71461'];
            options[31] = ['دهرم', '74781'];
            options[32] = ['رونيز ', '74461'];
            options[33] = ['زاهدشهر', '74671'];
            options[34] = ['زرقان', '7341'];
            options[35] = ['سروستان', '73451'];
            options[36] = ['سعادت شهر ـ پاسارگاد', '73741'];
            options[37] = ['سيدان', '73771'];
            options[38] = ['ششده', '74651'];
            options[39] = ['شهر جديد صدرا', '71991'];
            options[40] = ['شيراز', '71'];
            options[41] = ['صغاد', '73931'];
            options[42] = ['صفاشهر ـ خرم بيد', '73951'];
            options[43] = ['طسوج', '71641'];
            options[44] = ['علاءمرودشت', '74441'];
            options[45] = ['فدامي', '74871'];
            options[46] = ['فراشبند', '74771'];
            options[47] = ['فسا', '7461'];
            options[48] = ['فيروزآباد', '7471'];
            options[49] = ['فيشور', '74311'];
            options[50] = ['قادرآباد', '73751'];
            options[51] = ['قائميه', '7331'];
            options[52] = ['قطب آباد', '74551'];
            options[53] = ['قطرويه', '74981'];
            options[54] = ['قير و كارزين', '74761'];
            options[55] = ['كازرون', '731'];
            options[56] = ['كام فيروز', '73431'];
            options[57] = ['كلاني', '73141'];
            options[58] = ['كنارتخته', '73331'];
            options[59] = ['كوار', '73461'];
            options[60] = ['گراش', '7441'];
            options[61] = ['گويم', '73491'];
            options[62] = ['لار ـ لارستان', '7431'];
            options[63] = ['لامرد', '74341'];
            options[64] = ['مبارك آباد', '74731'];
            options[65] = ['مرودشت', '7371'];
            options[66] = ['مشكان', '74971'];
            options[67] = ['مصيري ـ رستم', '73571'];
            options[68] = ['مظفري', '71661'];
            options[69] = ['مهر', '74451'];
            options[70] = ['ميمند', '74741'];
            options[71] = ['نورآباد ـ ممسني', '7351'];
            options[72] = ['ني ريز', '7491'];
            options[73] = ['وراوي', '73171'];
        }
        if (state == 6) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابريشم', '81789'];
            options[2] = ['ابوزيدآباد', '87481'];
            options[3] = ['اردستان', '8381'];
            options[4] = ['اريسمان', '87641'];
            options[5] = ['اژيه', '83781'];
            options[6] = ['اسفرجان', '8651'];
            options[7] = ['اسلام آباد', '86481'];
            options[8] = ['اشن', '85451'];
            options[9] = ['اصغرآباد', '84351'];
            options[10] = ['اصفهان', '81'];
            options[11] = ['امين آباد', '86531'];
            options[12] = ['ايمان شهر', '84651'];
            options[13] = ['آران وبيدگل', '8741'];
            options[14] = ['بادرود', '87661'];
            options[15] = ['باغ بهادران', '84761'];
            options[16] = ['بهارستان', '81431'];
            options[17] = ['بوئين ومياندشت', '85651'];
            options[18] = ['پيربكران', '84541'];
            options[19] = ['تودشك', '81351'];
            options[20] = ['تيران', '8531'];
            options[21] = ['جعفرآباد', '84381'];
            options[22] = ['جندق', '83631'];
            options[23] = ['جوجيل', '84691'];
            options[24] = ['چادگان', '8571'];
            options[25] = ['چرمهين', '84751'];
            options[26] = ['چمگردان', '84781'];
            options[27] = ['حسن اباد', '83791'];
            options[28] = ['خالدآباد', '87671'];
            options[29] = ['خميني شهر', '841'];
            options[30] = ['خوانسار', '8791'];
            options[31] = ['خوانسارك', '84531'];
            options[32] = ['خور', '8361'];
            options[33] = ['خوراسگان', '81561'];
            options[34] = ['خورزوق', '83451'];
            options[35] = ['داران ـ فريدن', '8561'];
            options[36] = ['درچه پياز', '8431'];
            options[37] = ['دستگردوبرخوار', '83431'];
            options[38] = ['دهاقان', '8641'];
            options[39] = ['دهق', '8541'];
            options[40] = ['دولت آباد', '8341'];
            options[41] = ['ديزيچه', '84831'];
            options[42] = ['رزوه', '85761'];
            options[43] = ['رضوان شهر', '85331'];
            options[44] = ['رهنان', '81879'];
            options[45] = ['زاينده رود', '84931'];
            options[46] = ['زرين شهر ـ لنجان', '8471'];
            options[47] = ['زواره', '8441'];
            options[48] = ['زيار', '81681'];
            options[49] = ['زيبا شهر', '84841'];
            options[50] = ['سپاهان شهر', '87992'];
            options[51] = ['سده لنجان', '84741'];
            options[52] = ['سميرم', '8661'];
            options[53] = ['شاهين شهر', '831'];
            options[54] = ['شهرضا', '861'];
            options[55] = ['شهرك صنعتي مورچ', '83331'];
            options[56] = ['شهرك مجلسي', '8631'];
            options[57] = ['شهرک صنعتي محمودآباد', '8161'];
            options[58] = ['طالخونچه', '84981'];
            options[59] = ['عسگران', '85351'];
            options[60] = ['علويچه', '8551'];
            options[61] = ['غرغن', '85631'];
            options[62] = ['فرخي', '83641'];
            options[63] = ['فريدون شهر', '8591'];
            options[64] = ['فلاورجان', '8451'];
            options[65] = ['فولادشهر', '8491'];
            options[66] = ['فولادمباركه', '84881'];
            options[67] = ['قهد ريجان', '8461'];
            options[68] = ['كاشان', '871'];
            options[69] = ['كليشادوسودرجان', '84561'];
            options[70] = ['كمشچه', '83591'];
            options[71] = ['كوهپايه', '8371'];
            options[72] = ['گز', '83441'];
            options[73] = ['گلپايگان', '8771'];
            options[74] = ['گلدشت', '85831'];
            options[75] = ['گلشهر', '87841'];
            options[76] = ['گوگد', '8781'];
            options[77] = ['مباركه', '8481'];
            options[78] = ['مهاباد', '84431'];
            options[79] = ['مورچه خورت', '8331'];
            options[80] = ['ميمه', '8351'];
            options[81] = ['نائين', '8391'];
            options[82] = ['نجف آباد', '851'];
            options[83] = ['نصر آباد', '81751'];
            options[84] = ['نطنز', '8761'];
            options[85] = ['نيك آباد', '83771'];
            options[86] = ['بهارستان', '81431'];
            options[87] = ['هرند', '83741'];
            options[88] = ['ورزنه', '83751'];
            options[89] = ['ورنامخواست', '84731'];
            options[90] = ['ویلاشهر', '8581'];
        }
        if (state == 7) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابدال آباد', '95781'];
            options[2] = ['ازادوار', '96441'];
            options[3] = ['باجگيران', '94861'];
            options[4] = ['باخرز', '95971'];
            options[5] = ['باسفر', '95481'];
            options[6] = ['بجستان', '96981'];
            options[7] = ['بردسكن', '9681'];
            options[8] = ['برون', '97741'];
            options[9] = ['بزنگان', '93871'];
            options[10] = ['بند قرائ', '96791'];
            options[11] = ['بيدخت', '96941'];
            options[12] = ['تايباد', '9591'];
            options[13] = ['تربت جام', '9571'];
            options[14] = ['تربت حيدريه', '951'];
            options[15] = ['جغتاي', '9641'];
            options[16] = ['جنگل', '95471'];
            options[17] = ['چمن آباد', '95671'];
            options[18] = ['چناران', '9361'];
            options[19] = ['خليل آباد', '96771'];
            options[20] = ['خواف', '9561'];
            options[21] = ['داورزن', '9631'];
            options[22] = ['درگز', '9491'];
            options[23] = ['دولت آباد ـ زاوه', '95491'];
            options[24] = ['رادكان', '93631'];
            options[25] = ['رشتخوار', '9541'];
            options[26] = ['رضويه', '91671'];
            options[27] = ['ريوش(كوهسرخ)', '96741'];
            options[28] = ['سبزوار', '961'];
            options[29] = ['سرخس', '9381'];
            options[30] = ['سلطان آباد', '96561'];
            options[31] = ['سنگان', '95641'];
            options[32] = ['شانديز', '93561'];
            options[33] = ['صالح آباد', '9581'];
            options[34] = ['طرقبه ـ بينالود', '9351'];
            options[35] = ['طوس سفلي', '93571'];
            options[36] = ['فريمان', '9391'];
            options[37] = ['فيروزه ـ تخت جلگه', '9331'];
            options[38] = ['فيض آباد ـ مه ولات', '9531'];
            options[39] = ['قاسم آباد', '95661'];
            options[40] = ['قدمگاه', '93461'];
            options[41] = ['قوچان', '9471'];
            options[42] = ['كاخك', '96961'];
            options[43] = ['كاشمر', '9671'];
            options[44] = ['كلات', '9371'];
            options[45] = ['گلبهار', '93651'];
            options[46] = ['گناباد', '9691'];
            options[47] = ['لطف آباد', '94941'];
            options[48] = ['مشهد', '91'];
            options[49] = ['مشهدريزه', '95961'];
            options[50] = ['مصعبي', '97761'];
            options[51] = ['نشتيفان', '95631'];
            options[52] = ['نقاب ـ جوين', '96471'];
            options[53] = ['نيشابور', '931'];
            options[54] = ['نيل شهر', '95751'];
        }
        if (state == 8) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['َآوج', '3461'];
            options[2] = ['ارداق', '34671'];
            options[3] = ['اسفرورين', '34561'];
            options[4] = ['اقباليه', '34171'];
            options[5] = ['الوند ـ البرز', '3431'];
            options[6] = ['آبگرم', '34641'];
            options[7] = ['آبيك', '3441'];
            options[8] = ['آقابابا', '34791'];
            options[9] = ['بوئين زهرا', '3451'];
            options[10] = ['بیدستان', '34151'];
            options[11] = ['تاكستان', '3481'];
            options[12] = ['حصاروليعصر', '34691'];
            options[13] = ['خاكعلي', '34481'];
            options[14] = ['خرم دشت', '34831'];
            options[15] = ['دانسفهان', '34581'];
            options[16] = ['سيردان', '34741'];
            options[17] = ['شال', '34571'];
            options[18] = ['شهر صنعتي البرز', '3410'];
            options[19] = ['ضياآباد', '34851'];
            options[20] = ['قزوين', '341'];
            options[21] = ['ليا', '34491'];
            options[22] = ['محمديه', '3491'];
            options[23] = ['محمود آباد نمونه', '34131'];
            options[24] = ['معلم كلايه', '34931'];
            options[25] = ['نرجه', '34811'];
        }
        if (state == 9) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ارادان', '35861'];
            options[2] = ['اميريه', '3681'];
            options[3] = ['ايوانكي', '3591'];
            options[4] = ['بسطام', '3641'];
            options[5] = ['بيارجمند', '3661'];
            options[6] = ['خيرآباد', '35331'];
            options[7] = ['دامغان', '3671'];
            options[8] = ['درجزين', '35631'];
            options[9] = ['سرخه', '3551'];
            options[10] = ['سمنان', '351'];
            options[11] = ['شاهرود', '361'];
            options[12] = ['شهميرزاد', '3571'];
            options[13] = ['گرمسار', '3581'];
            options[14] = ['مجن', '3651'];
            options[15] = ['مهدي شهر', '3561'];
            options[16] = ['ميامي', '3631'];
            options[17] = ['ميغان', '36441'];
        }
        if (state == 10) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['دستجرد', '3741'];
            options[2] = ['سلفچگان', '37461'];
            options[3] = ['شهر جعفریه', '37441'];
            options[4] = ['قم', '371'];
            options[5] = ['قنوات', '3731'];
            options[6] = ['كهك', '37351'];
        }
        if (state == 11) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اراك', '381'];
            options[2] = ['آستانه', '3871'];
            options[3] = ['آشتيان', '3961'];
            options[4] = ['تفرش', '3951'];
            options[5] = ['توره', '38661'];
            options[6] = ['جاورسيان', '38451'];
            options[7] = ['خسروبيك', '38541'];
            options[8] = ['خشك رود', '37761'];
            options[9] = ['خمين', '3881'];
            options[10] = ['خنداب', '3841'];
            options[11] = ['دليجان', '3791'];
            options[12] = ['ريحان عليا', '38941'];
            options[13] = ['زاويه', '39441'];
            options[14] = ['ساوه', '391'];
            options[15] = ['شازند', '3861'];
            options[16] = ['شهراب', '39541'];
            options[17] = ['شهرك مهاجران', '3991'];
            options[18] = ['فرمهين', '39531'];
            options[19] = ['كميجان', '3851'];
            options[20] = ['مامونيه ـ زرنديه', '3941'];
            options[21] = ['محلات', '3781'];
            options[22] = ['ميلاجرد', '38551'];
            options[23] = ['هندودر', '38761'];
        }
        if (state == 12) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = [' آب بر ـ طارم', '4591'];
            options[2] = ['ابهر', '4561'];
            options[3] = ['اسفجين', '45371'];
            options[4] = ['پري', '45431'];
            options[5] = ['حلب', '45971'];
            options[6] = ['خرمدره', '4571'];
            options[7] = ['دستجرده', '45941'];
            options[8] = ['دندي', '45471'];
            options[9] = ['زرين آباد ـ ايجرود', '4531'];
            options[10] = ['زرين رود', '45881'];
            options[11] = ['زنجان', '451'];
            options[12] = ['سلطانيه', '4551'];
            options[13] = ['صائين قلعه', '45741'];
            options[14] = ['قيدار', '4581'];
            options[15] = ['گرماب', '45871'];
            options[16] = ['گيلوان', '45931'];
            options[17] = ['ماهنشان', '4541'];
            options[18] = ['همايون', '45331'];
            options[19] = ['هيدج', '45731'];
        }
        if (state == 13) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اسلام آباد', '48451'];
            options[2] = ['اميركلا', '4731'];
            options[3] = ['ايزدشهر', '46411'];
            options[4] = ['آمل', '461'];
            options[5] = ['آهنگركلا', '47341'];
            options[6] = ['بابل', '471'];
            options[7] = ['بابلسر', '4741'];
            options[8] = ['بلده', '46471'];
            options[9] = ['بهشهر', '4851'];
            options[10] = ['بهنمير', '47441'];
            options[11] = ['پل سفيد ـ سوادكوه', '4791'];
            options[12] = ['تنكابن', '4681'];
            options[13] = ['جويبار', '4771'];
            options[14] = ['چالوس', '4661'];
            options[15] = ['چمستان', '46431'];
            options[16] = ['خرم آباد', '46851'];
            options[17] = ['خوشرودپی', '47331'];
            options[18] = ['رامسر', '4691'];
            options[19] = ['رستم كلا', '48561'];
            options[20] = ['رويانشهر', '46561'];
            options[21] = ['زاغمرز', '48541'];
            options[22] = ['زرگر محله', '47581'];
            options[23] = ['زيرآب', '4781'];
            options[24] = ['سادات محله', '46931'];
            options[25] = ['ساري', '481'];
            options[26] = ['سرخرود', '46341'];
            options[27] = ['سلمانشهر', '4671'];
            options[28] = ['سنگده', '48351'];
            options[29] = ['سوا', '46371'];
            options[30] = ['سورك', '48441'];
            options[31] = ['شيرگاه', '47871'];
            options[32] = ['شيرود', '46861'];
            options[33] = ['عباس آباد', '46741'];
            options[34] = ['فريدون كنار', '4751'];
            options[35] = ['قائم شهر', '4761'];
            options[36] = ['كلارآباد', '46731'];
            options[37] = ['كلاردشت', '46661'];
            options[38] = ['كيا كلا', '47731'];
            options[39] = ['كياسر', '4831'];
            options[40] = ['گزنك', '46391'];
            options[41] = ['گلوگاه', '4861'];
            options[42] = ['گهرباران', '48461'];
            options[43] = ['محمودآباد', '4631'];
            options[44] = ['مرزن آباد', '46641'];
            options[45] = ['مرزي كلا', '47561'];
            options[46] = ['نشتارود', '46831'];
            options[47] = ['نكاء', '4841'];
            options[48] = ['نور', '4641'];
            options[49] = ['نوشهر', '4651'];
        }
        if (state == 14) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['انبار آلوم', '49391'];
            options[2] = ['اينچه برون', '49751'];
            options[3] = ['آزادشهر', '4961'];
            options[4] = ['آق قلا', '4931'];
            options[5] = ['بندر گز', '4871'];
            options[6] = ['بندرتركمن', '4891'];
            options[7] = ['جلين', '49351'];
            options[8] = ['خان ببين', '49531'];
            options[9] = ['راميان', '4951'];
            options[10] = ['سيمين شهر', '48971'];
            options[11] = ['علي آباد', '4941'];
            options[12] = ['فاضل آباد', '49431'];
            options[13] = ['كردكوي', '4881'];
            options[14] = ['كلاله', '4991'];
            options[15] = ['گاليكش', '49831'];
            options[16] = ['گرگان', '491'];
            options[17] = ['گميش تپه', '48961'];
            options[18] = ['گنبدكاوس', '4971'];
            options[19] = ['مراوه تپه', '48733'];
            options[20] = ['مينودشت', '4981'];
        }
        if (state == 15) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابي بيگلو', '56331'];
            options[2] = ['اردبيل', '561'];
            options[3] = ['اصلاندوز', '56981'];
            options[4] = ['بيله سوار', '5671'];
            options[5] = ['پارس آباد', '5691'];
            options[6] = ['تازه كند انگوت', '56581'];
            options[7] = ['جعفرآباد', '56751'];
            options[8] = ['خلخال', '5681'];
            options[9] = ['سرعين', '56391'];
            options[10] = ['شهرك شهيد غفاري', '56971'];
            options[11] = ['كلور', '56891'];
            options[12] = ['كوارئيم', '56431'];
            options[13] = ['گرمي ', '5651'];
            options[14] = ['گيوي ـ كوثر', '56851'];
            options[15] = ['لاهرود', '56653'];
            options[16] = ['مشگين شهر', '5661'];
            options[17] = ['نمين', '5631'];
            options[18] = ['نير', '5641'];
            options[19] = ['هشتجين', '56871'];
        }
        if (state == 16) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اروميه', '571'];
            options[2] = ['اشنويه', '5771'];
            options[3] = ['ايواوغلي', '5831'];
            options[4] = ['بازرگان', '58671'];
            options[5] = ['بوكان', '5951'];
            options[6] = ['پسوه', '57951'];
            options[7] = ['پلدشت', '58771'];
            options[8] = ['پيرانشهر', '5781'];
            options[9] = ['تازه شهر', '5891'];
            options[10] = ['تكاب', '5991'];
            options[11] = ['چهاربرج قديم', '59771'];
            options[12] = ['خوي', '581'];
            options[13] = ['ديزج', '57451'];
            options[14] = ['ديزجديز', '5837'];
            options[15] = ['ربط', '59691'];
            options[16] = ['زيوه', '57461'];
            options[17] = ['سردشت', '5961'];
            options[18] = ['سلماس', '5881'];
            options[19] = ['سيلوانا', '57411'];
            options[20] = ['سيلوه', '573'];
            options[21] = ['سيه چشمه ـ چالدران', '5871'];
            options[22] = ['شاهين دژ', '5981'];
            options[23] = ['شوط', '58751'];
            options[24] = ['قره ضياء الدين ـ چايپاره', '5851'];
            options[25] = ['قوشچي', '5751'];
            options[26] = ['كشاورز (اقبال)', '59731'];
            options[27] = ['ماكو', '5861'];
            options[28] = ['محمد يار', '57661'];
            options[29] = ['محمودآباد', '59861'];
            options[30] = ['مهاباد', '591'];
            options[31] = ['مياندوآب', '5971'];
            options[32] = ['مياوق', '57351'];
            options[33] = ['ميرآباد', '59671'];
            options[34] = ['نقده', '5761'];
            options[35] = ['نوشين شهر', '57381'];
        }
        if (state == 17) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ازندريان', '65995'];
            options[2] = ['اسدآباد', '6541'];
            options[3] = ['اسلام آباد', '65791'];
            options[4] = ['بهار', '6531'];
            options[5] = ['پايگاه نوژه', '65992'];
            options[6] = ['تويسركان', '6581'];
            options[7] = ['دمق', '65671'];
            options[8] = ['رزن', '65681'];
            options[9] = ['سامن', '65761'];
            options[10] = ['سركان', '65841'];
            options[11] = ['شيرين سو', '65571'];
            options[12] = ['صالح آباد', '65361'];
            options[13] = ['فامنين', '6561'];
            options[14] = ['قروه درجزين', '65691'];
            options[15] = ['قهاوند', '65631'];
            options[16] = ['كبودرآهنگ', '6551'];
            options[17] = ['گيان', '65961'];
            options[18] = ['لالجين', '65331'];
            options[19] = ['ملاير', '6571'];
            options[20] = ['نهاوند', '6591'];
            options[21] = ['همدان', '651'];
        }
        if (state == 18) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اورامانتخت', '66791'];
            options[2] = ['بانه', '6691'];
            options[3] = ['بلبان آباد', '66661'];
            options[4] = ['بيجار', '6651'];
            options[5] = ['دلبران', '66631'];
            options[6] = ['دهگلان', '66671'];
            options[7] = ['ديواندره', '6641'];
            options[8] = ['سروآباد', '66781'];
            options[9] = ['سريش آباد', '66691'];
            options[10] = ['سقز', '6681'];
            options[11] = ['سنندج', '661'];
            options[12] = ['قروه', '6661'];
            options[13] = ['كامياران', '6631'];
            options[14] = ['مريوان', '6671'];
            options[15] = ['موچش', '66391'];
        }
        if (state == 19) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اسلام آباد غرب', '6761'];
            options[2] = ['باينگان', '67931'];
            options[3] = ['بيستون', '67371'];
            options[4] = ['پاوه', '6791'];
            options[5] = ['تازه آباد ـ ثلاث باباجاني', '67771'];
            options[6] = ['جوانرود', '67981'];
            options[7] = ['روانسر', '67961'];
            options[8] = ['ريجاب', '67651'];
            options[9] = ['سراب ذهاب', '67741'];
            options[10] = ['سرپل ذهاب', '6771'];
            options[11] = ['سنقر', '6751'];
            options[12] = ['صحنه', '67461'];
            options[13] = ['فرامان', '67441'];
            options[14] = ['فش', '67431'];
            options[15] = ['قصرشيرين', '6781'];
            options[16] = ['كرمانشاه', '671'];
            options[17] = ['كنگاور', '6741'];
            options[18] = ['گيلانغرب', '67871'];
            options[19] = ['نودشه', '67951'];
            options[20] = ['هرسين', '6731'];
            options[21] = ['هلشي', '67341'];
        }
        if (state == 20) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ازنا', '6871'];
            options[2] = ['الشتر ـ سلسله', '6891'];
            options[3] = ['اليگودرز', '6861'];
            options[4] = ['برخوردار', '68331'];
            options[5] = ['بروجرد', '691'];
            options[6] = ['پل دختر', '6851'];
            options[7] = ['تقي آباد', '68391'];
            options[8] = ['چغلوندی', '68181'];
            options[9] = ['چقابل', '68451'];
            options[10] = ['خرم آباد', '681'];
            options[11] = ['دورود', '6881'];
            options[12] = ['زاغه', '68761'];
            options[13] = ['سپيددشت', '68861'];
            options[14] = ['شول آباد', '68671'];
            options[15] = ['كوناني', '68471'];
            options[16] = ['كوهدشت', '6841'];
            options[17] = ['معمولان', '68571'];
            options[18] = ['نورآباد ـ دلفان', '6831'];
            options[19] = ['واشيان نصيرتپه', '68541'];
        }
        if (state == 21) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابدان', '75551'];
            options[2] = ['اهرم ـ تنگستان', '7551'];
            options[3] = ['آباد', '75491'];
            options[4] = ['آبپخش', '75651'];
            options[5] = ['بادوله', '75431'];
            options[6] = ['برازجان ـ دشتستان', '7561'];
            options[7] = ['بردخون', '75531'];
            options[8] = ['بندردير', '75541'];
            options[9] = ['بندرديلم', '75361'];
            options[10] = ['بندرريگ', '75331'];
            options[11] = ['بندركنگان', '75571'];
            options[12] = ['بندرگناوه', '7531'];
            options[13] = ['بوشهر', '751'];
            options[14] = ['تنگ ارم', '75681'];
            options[15] = ['جزيره خارك', '75461'];
            options[16] = ['جم', '75581'];
            options[17] = ['چغارك', '75381'];
            options[18] = ['خورموج ـ دشتي', '7541'];
            options[19] = ['دلوار', '75471'];
            options[20] = ['ريز', '75561'];
            options[21] = ['سعدآباد', '75661'];
            options[22] = ['شبانكاره', '75641'];
            options[23] = ['شنبه', '75441'];
            options[24] = ['شول', '75351'];
            options[25] = ['عالی شهر', '75196'];
            options[26] = ['عسلويه', '75391'];
            options[27] = ['كاكي', '75451'];
            options[28] = ['كلمه', '75691'];
            options[29] = ['نخل تقي', '75111'];
            options[30] = ['وحدتيه', '75671'];
        }
        if (state == 22) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اختيارآباد', '76381'];
            options[2] = ['ارزوئیه', '78591'];
            options[3] = ['امين شهر', '77431'];
            options[4] = ['انار', '7741'];
            options[5] = ['باغين', '76371'];
            options[6] = ['بافت', '7851'];
            options[7] = ['بردسير', '7841'];
            options[8] = ['بلوك', '78791'];
            options[9] = ['بم', '7661'];
            options[10] = ['بهرمان', '77461'];
            options[11] = ['پاريز', '7831'];
            options[12] = ['جواديه فلاح', '77471'];
            options[13] = ['جوشان', '76431'];
            options[14] = ['جيرفت', '7861'];
            options[15] = ['چترود', '7791'];
            options[16] = ['خانوك', '77761'];
            options[17] = ['دوساري', '78771'];
            options[18] = ['رابر', '78561'];
            options[19] = ['راور', '7651'];
            options[20] = ['راين', '7681'];
            options[21] = ['رفسنجان', '771'];
            options[22] = ['رودبار', '78831'];
            options[23] = ['ريگان', '76761'];
            options[24] = ['زرند', '7761'];
            options[25] = ['زنگي آباد', '76391'];
            options[26] = ['سرچشمه', '7731'];
            options[27] = ['سريز', '77751'];
            options[28] = ['سيرجان', '781'];
            options[29] = ['شهربابك', '7751'];
            options[30] = ['صفائيه', '77391'];
            options[31] = ['عنبرآباد', '7871'];
            options[32] = ['فارياب', '78871'];
            options[33] = ['فهرج', '76741'];
            options[34] = ['قلعه گنج', '78841'];
            options[35] = ['كاظم آباد', '77951'];
            options[36] = ['كرمان', '761'];
            options[37] = ['كهنوج', '7881'];
            options[38] = ['كهنوج( مغزآباد)', '77941'];
            options[39] = ['كوهبنان', '7781'];
            options[40] = ['كيان شهر', '7771'];
            options[41] = ['گلباف', '7641'];
            options[42] = ['ماهان', '7631'];
            options[43] = ['محمدآباد ـ ريگان', '7691'];
            options[44] = ['محي آباد', '76891'];
            options[45] = ['منوجان', '7891'];
            options[46] = ['نجف شهر', '78151'];
            options[47] = ['نگار', '78431'];
        }
        if (state == 23) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابوموسي', '79591'];
            options[2] = ['ايسين', '79331'];
            options[3] = ['بستك', '7961'];
            options[4] = ['بندرخمير', '7931'];
            options[5] = ['بندرعباس', '791'];
            options[6] = ['بندرلنگه', '7971'];
            options[7] = ['بندزك كهنه', '79981'];
            options[8] = ['پارسيان', '79771'];
            options[9] = ['پدل', '79631'];
            options[10] = ['پل شرقي', '79341'];
            options[11] = ['تياب', '79971'];
            options[12] = ['جاسك', '79791'];
            options[13] = ['جزيره سيري', '79581'];
            options[14] = ['جزيره لاوان', '79781'];
            options[15] = ['جزيره هنگام', '79571'];
            options[16] = ['جزيرهلارك', '79561'];
            options[17] = ['جناح', '79611'];
            options[18] = ['چارك', '79751'];
            options[19] = ['حاجي آباد', '79391'];
            options[20] = ['درگهان', '79531'];
            options[21] = ['دشتي', '79761'];
            options[22] = ['دهبارز ـ رودان', '7991'];
            options[23] = ['رويدر', '79661'];
            options[24] = ['زيارت علي', '79941'];
            options[25] = ['سردشت ـ بشاگرد', '79881'];
            options[26] = ['سندرك', '79841'];
            options[27] = ['سيريك', '79461'];
            options[28] = ['فارغان', '79371'];
            options[29] = ['فين', '79351'];
            options[30] = ['قشم', '7951'];
            options[31] = ['كنگ', '79641'];
            options[32] = ['كيش', '7941'];
            options[33] = ['ميناب', '7981'];
        }
        if (state == 24) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اردل', '8881'];
            options[2] = ['آلوني', '88941'];
            options[3] = ['باباحيدر', '88631'];
            options[4] = ['بروجن', '8871'];
            options[5] = ['بلداجي', '88761'];
            options[6] = ['بن', '88581'];
            options[7] = ['جونقان', '88671'];
            options[8] = ['چالشتر', '88471'];
            options[9] = ['چلگرد ـ كوهرنگ', '88651'];
            options[10] = ['دزك', '8834'];
            options[11] = ['دستنائ', '88361'];
            options[12] = ['دشتك', '88881'];
            options[13] = ['سامان', '8851'];
            options[14] = ['سودجان', '88461'];
            options[15] = ['سورشجان', '88431'];
            options[16] = ['شلمزار ـ كيار', '88371'];
            options[17] = ['شهركرد', '881'];
            options[18] = ['فارسان', '8861'];
            options[19] = ['فرادنبه', '88741'];
            options[20] = ['فرخ شهر', '8831'];
            options[21] = ['كیان', '88139'];
            options[22] = ['گندمان', '88781'];
            options[23] = ['گهرو', '88381'];
            options[24] = ['لردگان', '8891'];
            options[25] = ['مال خليفه', '88951'];
            options[26] = ['ناغان', '88831'];
            options[27] = ['هاروني', '8844'];
            options[28] = ['هفشجان', '8841'];
            options[29] = ['وردنجان', '88571'];
        }
        if (state == 25) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ابركوه', '8931'];
            options[2] = ['احمدآباد', '89531'];
            options[3] = ['اردكان', '8951'];
            options[4] = ['بافق', '8971'];
            options[5] = ['بفروئيه', '89631'];
            options[6] = ['بهاباد', '89761'];
            options[7] = ['تفت', '8991'];
            options[8] = ['حميديا', '89491'];
            options[9] = ['زارچ', '89418'];
            options[10] = ['شاهديه', '89431'];
            options[11] = ['صدوق', '8941'];
            options[12] = ['طبس', '9791'];
            options[13] = ['عشق آباد', '97981'];
            options[14] = ['فراغه', '89331'];
            options[15] = ['مروست', '89871'];
            options[16] = ['مهريز', '8981'];
            options[17] = ['ميبد', '8961'];
            options[18] = ['نير', '89961'];
            options[19] = ['هرات ـ خاتم', '89881'];
            options[20] = ['يزد', '891'];
        }
        if (state == 26) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اسپكه', '99431'];
            options[2] = ['ايرانشهر', '991'];
            options[3] = ['بزمان', '99491'];
            options[4] = ['بمپور', '9941'];
            options[5] = ['بنت', '99451'];
            options[6] = ['بنجار', '98691'];
            options[7] = ['پسكو', '99641'];
            options[8] = ['تيموراباد', '98641'];
            options[9] = ['جالق', '99561'];
            options[10] = ['چابهار', '9971'];
            options[11] = ['خاش', '9891'];
            options[12] = ['دوست محمد ـ هيرمند', '9851'];
            options[13] = ['راسك', '99361'];
            options[14] = ['زابل', '9861'];
            options[15] = ['زابلي', '99661'];
            options[16] = ['زاهدان', '981'];
            options[17] = ['زهك', '9871'];
            options[18] = ['ساربوك', '99991'];
            options[19] = ['سراوان', '9951'];
            options[20] = ['سرباز', '9931'];
            options[21] = ['سنگان', '98971'];
            options[22] = ['سوران ـ سيب سوران', '9961'];
            options[23] = ['سيركان', '99571'];
            options[24] = ['فنوج', '99461'];
            options[25] = ['قصرقند', '99961'];
            options[26] = ['كنارك', '9981'];
            options[27] = ['كيتج', '99881'];
            options[28] = ['گلمورتي ـ دلگان', '99471'];
            options[29] = ['گوهركوه', '98931'];
            options[30] = ['محمدآباد', '98681'];
            options[31] = ['ميرجاوه', '9841'];
            options[32] = ['نصرت آباد', '9831'];
            options[33] = ['نگور', '99761'];
            options[34] = ['نيك شهر', '9991'];
            options[35] = ['هيدوچ', '99671'];
        }
        if (state == 27) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اركواز', '69971'];
            options[2] = ['ارمو', '69641'];
            options[3] = ['ايلام', '6931'];
            options[4] = ['ايوان', '6941'];
            options[5] = ['آبدانان', '6971'];
            options[6] = ['آسمان آباد', '69561'];
            options[7] = ['بدره', '69671'];
            options[8] = ['توحيد', '69531'];
            options[9] = ['چشمه شيرين', '69661'];
            options[10] = ['چوار', '69361'];
            options[11] = ['دره شهر', '6961'];
            options[12] = ['دهلران', '6981'];
            options[13] = ['سرابله ـ شيروان و چرداول', '6951'];
            options[14] = ['شباب ', '69511'];
            options[15] = ['شهرك اسلاميه', '69931'];
            options[16] = ['لومار', '69551'];
            options[17] = ['مهران', '6991'];
            options[18] = ['موسيان', '69841'];
            options[19] = ['ميمه', '69861'];
        }
        if (state == 28) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['باشت', '75881'];
            options[2] = ['پاتاوه', '75981'];
            options[3] = ['چرام', '75761'];
            options[4] = ['دهدشت ـ كهگيلويه', '7571'];
            options[5] = ['دوگنبدان ـ گچساران', '7581'];
            options[6] = ['ديشموك', '75771'];
            options[7] = ['سپيدار', '75931'];
            options[8] = ['سوق', '75731'];
            options[9] = ['سي سخت ـ دنا', '75991'];
            options[10] = ['قلعه رئيسي', '75781'];
            options[11] = ['لنده', '75741'];
            options[12] = ['ليكك', '75751'];
            options[13] = ['مادوان', '75911'];
            options[14] = ['ياسوج', '7591'];
        }
        if (state == 29) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اسفراين', '9661'];
            options[2] = ['ايور', '94331'];
            options[3] = ['آشخانه ـ مانه و سلمقان', '9451'];
            options[4] = ['بجنورد', '941'];
            options[5] = ['جاجرم', '9441'];
            options[6] = ['درق', '94311'];
            options[7] = ['راز', '94561'];
            options[8] = ['شوقان', '94471'];
            options[9] = ['شيروان', '9461'];
            options[10] = ['فاروج', '9481'];
            options[11] = ['گرمه', '9431'];
        }
        if (state == 30) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['ارسك', '97831'];
            options[2] = ['اسديه ـ درميان', '97441'];
            options[3] = ['آرين شهر', '97631'];
            options[4] = ['آيسك', '97791'];
            options[5] = ['بشرويه', '9781'];
            options[6] = ['بیرجند', '971'];
            options[7] = ['حاجي آباد', '97671'];
            options[8] = ['خضري دشت بياض', '97661'];
            options[9] = ['خوسف', '97351'];
            options[10] = ['زهان', '97691'];
            options[11] = ['سر بیشه', '9741'];
            options[12] = ['سرايان', '97771'];
            options[13] = ['سه قلعه', '97891'];
            options[14] = ['فردوس', '9771'];
            options[15] = ['قائن ـ قائنات', '9761'];
            options[16] = ['گزيک', '97461'];
            options[17] = ['مود', '97311'];
            options[18] = ['نهبندان', '9751'];
            options[19] = ['نیمبلوك', '97443'];
        }
        if (state == 31) {
            options[0] = ['لطفا شهر را انتخاب نمایید', '0'];
            options[1] = ['اشتهارد', '31871'];
            options[2] = ['آسارا', '31551'];
            options[3] = ['چهارباغ', '33661'];
            options[4] = ['سيف آباد', '33611'];
            options[5] = ['شهر جديد هشتگرد', '33618'];
            options[6] = ['طالقان', '33691'];
            options[7] = ['كرج', '31'];
            options[8] = ['كمال شهر', '31991'];
            options[9] = ['كوهسار ـ چندار', '33651'];
            options[10] = ['گرمدره', '31638'];
            options[11] = ['ماهدشت', '31849'];
            options[12] = ['محمدشهر', '31778'];
            options[13] = ['مشکين دشت', '31776'];
            options[14] = ['نظرآباد', '3331'];
            options[15] = ['هشتگرد ـ ساوجبلاغ', '3361'];
        }
        let citySels = [...citySel];
        citySels = options
        setCitySel(citySels);
    }

    const handleCity = e => {
        e.preventDefault();
        let citySelectHtml = document.querySelector(".citySelected");
        let cityName = citySelectHtml.options[citySelectHtml.selectedIndex].text;
        props.handleCityName(cityName)
    }
    return (
        <div className={"row"}>
           <div className={"col-md-6 col-sm-12"}>
               <div className="form-group">
                   <label htmlFor="first-name-vertical">استان</label>
                   <fieldset className="form-group">
                       <select className="form-control" id="basicSelect" onChange={e => handleProvince(e.target.value)} style={{height : 50}}>
                           <option value="0">لطفا استان را انتخاب نمایید</option>
                           {stateName.map((item , index) => (
                               <option value={index+1}>{item}</option>
                           ))}

                       </select>
                   </fieldset>
               </div>
           </div>

            <div className={"col-md-6 col-sm-12"}>
                <div className="form-group">
                    <label htmlFor="first-name-vertical">شهر</label>
                    <fieldset className="form-group">
                        <select className="form-control citySelected" onChange={e => handleCity(e)} id="basicSelect"  style={{height : 50}}>
                            <option value="0">لطفا شهر را انتخاب نمایید</option>
                            {citySel.length > 0 ? citySel.map((item , index) => (
                                <option key={index} value={item[1]}>{item[0]}</option>
                            )) : (
                               ''
                            )}
                        </select>
                    </fieldset>
                </div>
            </div>
        </div>

    )
}
